<template>
  <h3>带状态</h3>
  <n-card bottom-divider>
    <p>
      内容区域的卡片形式。卡片内容区域可以是文字、图片、表单、表格等形式信息内容。可使用大中小不同的卡片尺寸，按业务需求进行呈现。
    </p>
    <template #footer>
      <footer class="footer-1">
        <span>2018-06-15</span>
        <svg
            t="1671430836155"
            class="icon"
            viewBox="0 0 1024 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="2785"
            xmlns:xlink="http://www.w3.org/1999/xlink"
            width="200"
            height="200"
        >
          <path
              d="M512.042667 682.666667c-94.122667 0-170.666667-76.544-170.666667-170.666667s76.544-170.666667 170.666667-170.666667 170.666667 76.544 170.666666 170.666667-76.586667 170.666667-170.666666 170.666667z m0-298.666667c-70.570667 0-128 57.429333-128 128s57.429333 128 128 128 128-57.429333 128-128-57.429333-128-128-128z"
              p-id="2786"
          ></path>
          <path
              d="M512.042667 810.666667C267.989333 810.666667 66.56 603.562667 10.666667 540.074667a42.922667 42.922667 0 0 1-0.085334-56.106667C66.517333 420.48 267.989333 213.333333 512.042667 213.333333c243.797333 0 445.098667 206.72 501.205333 270.378667l0.256 0.298667c13.866667 15.957333 13.866667 40.021333 0 55.978666C957.525333 603.52 756.053333 810.666667 512.042667 810.666667z m0-554.666667C285.909333 256 95.573333 452.010667 42.666667 512.128 95.616 571.989333 285.866667 768 512.042667 768c226.133333 0 416.426667-196.010667 469.376-256.128C928.426667 452.010667 738.133333 256 512.042667 256z"
              p-id="2787"
          ></path>
        </svg>
        <span>2919</span>
        <svg
            t="1671430836155"
            class="icon"
            viewBox="0 0 1024 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="2785"
            xmlns:xlink="http://www.w3.org/1999/xlink"
            width="200"
            height="200"
        >
          <path
              d="M512.042667 682.666667c-94.122667 0-170.666667-76.544-170.666667-170.666667s76.544-170.666667 170.666667-170.666667 170.666667 76.544 170.666666 170.666667-76.586667 170.666667-170.666666 170.666667z m0-298.666667c-70.570667 0-128 57.429333-128 128s57.429333 128 128 128 128-57.429333 128-128-57.429333-128-128-128z"
              p-id="2786"
          ></path>
          <path
              d="M512.042667 810.666667C267.989333 810.666667 66.56 603.562667 10.666667 540.074667a42.922667 42.922667 0 0 1-0.085334-56.106667C66.517333 420.48 267.989333 213.333333 512.042667 213.333333c243.797333 0 445.098667 206.72 501.205333 270.378667l0.256 0.298667c13.866667 15.957333 13.866667 40.021333 0 55.978666C957.525333 603.52 756.053333 810.666667 512.042667 810.666667z m0-554.666667C285.909333 256 95.573333 452.010667 42.666667 512.128 95.616 571.989333 285.866667 768 512.042667 768c226.133333 0 416.426667-196.010667 469.376-256.128C928.426667 452.010667 738.133333 256 512.042667 256z"
              p-id="2787"
          ></path>
        </svg>
        <span>2919</span>
      </footer>
    </template>
  </n-card>
  <h3 style="marginTop:2em">带输入</h3>
  <n-card bottom-divider>
    这是一段很长很长很长很长很长很长很长很长很长很长很长很长很长很长很的内容文案这是一段很长很长很长很长很长很长很长很长很长很长很长很长很长很长很的内容文案这是一段很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很的内容文案
    <template #footer>
      <footer class="footer-2">
        <n-input type="textarea" placeholder="请输入" />
      </footer>
    </template>
  </n-card>
</template>

<script setup lang="ts"></script>

<style lang="scss" scoped>
.footer-1 {
  display: flex;
  align-items: center;
  justify-content: space-between;
  color: #6f7385;
  font-weight: 400;
  font-size: 14px;
  line-height: 22px;
  .icon {
    width: 15px;
    height: 15px;
    margin-right: 4px;
    margin-left: 18px;
    &:first-of-type {
      margin-left: auto;
    }
  }
}
p {
  margin: 0;
}
</style>
